#### RAG Prompts ####

from string import Template # to have variables 

## System ##

system_prompt = Template("\n".join([

   " أنت مساعدٌ لإعداد ردٍّ للمستخدم.",
    "ستُزوَّد بمجموعة من المستندات المتعلقة باستفسار المستخدم.",
    "عليك إعداد ردٍّ بناءً على المستندات المُقدَّمة.",
    "تجاهل المستندات غير ذات الصلة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إعداد ردٍّ.",
    "يجب عليك إعداد الردّ بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا ​​في ردّك. تجنَّب المعلومات غير الضرورية.",
]))



## Document ##
documnet_prompt = Template(
    "\n".join([
    "## رقم الملف: $doc_num",
    "### المحتوى: $chunk_text", 
]))



#### Footer ####
footer_prompt = Template("\n".join([
    "بناء علء المحتوى السابق, اعطي الاجابة للمستخدم.",
    "## السؤال:",
    "$query",
    "",
    "## الجواب:",
]))